import datetime as dt

tanggal = int(input("Masukkan tanggal lahir: "))
bulan = int(input("Masukkan bulan lahir: "))
tahun = int(input("Masukkan tahun lahir: "))
komen = 10*"-" + " DATA ANDA " + 10*"-"
str_komen = f"""
\033[1m\033[34m
╔══════════════════════════════════════╗
║                DATA                  ║
╠══════════════════════════════════════╣
║  ➤ Tanggal Lahir: {tanggal:<19}║
║  ➤ Bulan Lahir: {bulan:<21}║
║  ➤ Tahun Lahir: {tahun:<21}║
║                                      ║
║  \033[92m{komen:<36}\033[34m║
╚══════════════════════════════════════╝
\033[0m
"""
print(str_komen)

tanggal_lahir = dt.date(tahun, bulan, tanggal)
print(f"tanggal lahir anda adalah : {tanggal_lahir}")

hari_ini = dt.date.today()
umur_hari = (hari_ini - tanggal_lahir).days
umur_tahun = umur_hari // 365

str_hariIni = "Hari"
str_umurHari = "tahun"
str_umurTahun = "tahun! ✨"

print_user = f"""
\033[1m\033[95m
╔══════════════════════════════════════════════════════════╗
║                    INFORMASI UMUR ANDA                   ║
╠══════════════════════════════════════════════════════════╣
\033[96m║  📅 Bulan Lahir     : \033[93m{'{:<35}'.format(f'{tanggal_lahir:%B}')}\033[96m║
\033[96m║  📆 Hari Lahir      : \033[93m{'{:<35}'.format(f'{tanggal_lahir:%A}')}\033[96m║
\033[96m║  📆 Hari Ini        : \033[93m{hari_ini:%A}, {'{:<27}'.format(f'{hari_ini}')}\033[96m║
╠══════════════════════════════════════════════════════════╣
\033[96m║  ⏳ Umur dalam Hari  : \033[92m{umur_hari} {str_hariIni:<29}\033[96m║
\033[96m║  🎂 Umur dalam Tahun : \033[92m{umur_tahun} {str_umurHari:<31}\033[96m║
╠══════════════════════════════════════════════════════════╣
\033[96m║  \033[1m\033[97m✨ Selamat! Anda sudah berusia {umur_tahun} {str_umurTahun:<21}\033[0m\033[96m║
\033[95m╚══════════════════════════════════════════════════════════╝
\033[0m
"""
print(print_user)